# VertexStreamPositionColored Properties

---
The VertexStreamPositionColored type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from VertexStream)
Top
#### Reference
VertexStreamPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace